OpenPuya/PY32M070_Firmware/Drivers/PY32M070_HAL_Driver/Inc/py32m070_ll_dma.h
/**
  * @brief  Set the DMA Remap
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  *         @arg @ref LL_DMA_CHANNEL_7
  * @param  MapReqNum This parameter can be one of the following values:
  *         @arg @ref LL_SYSCFG_DMA_MAP_ADC1
  *         @arg @ref LL_SYSCFG_DMA_MAP_DAC1
  *         @arg @ref LL_SYSCFG_DMA_MAP_DAC2
  *         @arg @ref LL_SYSCFG_DMA_MAP_SPI1_RD
  *         @arg @ref LL_SYSCFG_DMA_MAP_SPI1_WR
  *         @arg @ref LL_SYSCFG_DMA_MAP_SPI2_RD
  *         @arg @ref LL_SYSCFG_DMA_MAP_SPI2_WR
  *         @arg @ref LL_SYSCFG_DMA_MAP_USART1_RD
  *         @arg @ref LL_SYSCFG_DMA_MAP_USART1_WR
  *         @arg @ref LL_SYSCFG_DMA_MAP_USART2_RD
  *         @arg @ref LL_SYSCFG_DMA_MAP_USART2_WR
  *         @arg @ref LL_SYSCFG_DMA_MAP_USART3_RD
  *         @arg @ref LL_SYSCFG_DMA_MAP_USART3_WR
  *         @arg @ref LL_SYSCFG_DMA_MAP_USART4_RD
  *         @arg @ref LL_SYSCFG_DMA_MAP_USART4_WR
  *         @arg @ref LL_SYSCFG_DMA_MAP_I2C1_RD
  *         @arg @ref LL_SYSCFG_DMA_MAP_I2C1_WR
  *         @arg @ref LL_SYSCFG_DMA_MAP_I2C2_RD
  *         @arg @ref LL_SYSCFG_DMA_MAP_I2C2_WR
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM1_CH1
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM1_CH2
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM1_CH3
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM1_CH4
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM1_COM
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM1_TRG
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM1_UP
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM2_CH1
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM2_CH2
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM2_CH3
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM2_CH4
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM2_UP
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM2_TRG
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM3_CH1
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM3_CH2
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM3_CH3
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM3_CH4
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM3_UP
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM3_TRG
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM6_UP
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM7_UP
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM15_CH1
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM15_CH2
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM15_UP
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM15_TRG
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM15_COM
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM16_CH1
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM16_UP
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM17_CH1
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM17_UP
  *         @arg @ref LL_SYSCFG_DMA_MAP_USB
  *         @arg @ref LL_SYSCFG_DMA_MAP_LCD
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_SetDMARemap(DMA_TypeDef *DMAx, uint32_t Channel, uint32_t MapReqNum)
{
  uint32_t position; 
  
  position = ((uint32_t)Channel - (uint32_t)LL_DMA_CHANNEL_1) / ((uint32_t)LL_DMA_CHANNEL_2 - (uint32_t)LL_DMA_CHANNEL_1);
  
  if(position<4)
  {
    MODIFY_REG(SYSCFG->CFGR3, (0x3F << (8U * (position & 0x03U))), (MapReqNum << (8U * (position & 0x03U))));
  }
  else
  {
    position = position - 4;
    MODIFY_REG(SYSCFG->CFGR4, (0x3F << (8U * (position & 0x03U))), (MapReqNum << (8U * (position & 0x03U))));
  }    
}

/**
  * @brief  Get the DMA Remap
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  *         @arg @ref LL_DMA_CHANNEL_7
  * @return  MapReqNum This parameter can be one of the following values:
  *         @arg @ref LL_SYSCFG_DMA_MAP_ADC1
  *         @arg @ref LL_SYSCFG_DMA_MAP_DAC1
  *         @arg @ref LL_SYSCFG_DMA_MAP_DAC2
  *         @arg @ref LL_SYSCFG_DMA_MAP_SPI1_RD
  *         @arg @ref LL_SYSCFG_DMA_MAP_SPI1_WR
  *         @arg @ref LL_SYSCFG_DMA_MAP_SPI2_RD
  *         @arg @ref LL_SYSCFG_DMA_MAP_SPI2_WR
  *         @arg @ref LL_SYSCFG_DMA_MAP_USART1_RD
  *         @arg @ref LL_SYSCFG_DMA_MAP_USART1_WR
  *         @arg @ref LL_SYSCFG_DMA_MAP_USART2_RD
  *         @arg @ref LL_SYSCFG_DMA_MAP_USART2_WR
  *         @arg @ref LL_SYSCFG_DMA_MAP_USART3_RD
  *         @arg @ref LL_SYSCFG_DMA_MAP_USART3_WR
  *         @arg @ref LL_SYSCFG_DMA_MAP_USART4_RD
  *         @arg @ref LL_SYSCFG_DMA_MAP_USART4_WR
  *         @arg @ref LL_SYSCFG_DMA_MAP_I2C1_RD
  *         @arg @ref LL_SYSCFG_DMA_MAP_I2C1_WR
  *         @arg @ref LL_SYSCFG_DMA_MAP_I2C2_RD
  *         @arg @ref LL_SYSCFG_DMA_MAP_I2C2_WR
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM1_CH1
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM1_CH2
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM1_CH3
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM1_CH4
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM1_COM
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM1_TRG
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM1_UP
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM2_CH1
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM2_CH2
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM2_CH3
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM2_CH4
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM2_UP
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM2_TRG
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM3_CH1
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM3_CH2
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM3_CH3
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM3_CH4
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM3_UP
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM3_TRG
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM6_UP
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM7_UP
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM15_CH1
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM15_CH2
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM15_UP
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM15_TRG
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM15_COM
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM16_CH1
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM16_UP
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM17_CH1
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM17_UP
  *         @arg @ref LL_SYSCFG_DMA_MAP_USB
  *         @arg @ref LL_SYSCFG_DMA_MAP_LCD
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetDMARemap(DMA_TypeDef *DMAx,uint32_t Channel)
{
  uint32_t position;  

  position = ((uint32_t)Channel - (uint32_t)LL_DMA_CHANNEL_1) / ((uint32_t)LL_DMA_CHANNEL_2 - (uint32_t)LL_DMA_CHANNEL_1);

  if(position<4)
  {
    return (READ_BIT(SYSCFG->CFGR3, (0x3F << (8U * (position & 0x03U))))>>(8U * (position & 0x03U)));
  }
  else
  {
    position = position - 4;
    return (READ_BIT(SYSCFG->CFGR4, (0x3F << (8U * (position & 0x03U))))>>(8U * (position & 0x03U)));
  }    
}

/**
  * @}
  */

#if defined(USE_FULL_LL_DRIVER)
/** @defgroup DMA_LL_EF_Init Initialization and de-initialization functions
  * @{
  */

uint32_t LL_DMA_Init(DMA_TypeDef *DMAx, uint32_t Channel, LL_DMA_InitTypeDef *DMA_InitStruct);
uint32_t LL_DMA_DeInit(DMA_TypeDef *DMAx, uint32_t Channel);
void LL_DMA_StructInit(LL_DMA_InitTypeDef *DMA_InitStruct);

/**
  * @}
  */
#endif /* USE_FULL_LL_DRIVER */

/**
  * @}
  */

/**
  * @}
  */

#endif /* DMA1 */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __PY32M070_LL_DMA_H */

/************************ (C) COPYRIGHT Puya *****END OF FILE****/
